Revit.Elements.TextNote
Revit Text Note Element

Revit.Elements.TextNote.InternalTextNote
TextNote

Revit.Elements.TextNote.#ctor(Autodesk.Revit.DB.TextNote)
TextNote from existing
TextNote:

Revit.Elements.TextNote.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.HorizontalTextAlignment,System.String,System.Boolean,System.Double,Autodesk.Revit.DB.ElementId)
TextNote by Location
view:
origin:
alignment:
text:
keepRotatedTextreadable:
rotation: in degrees
typeId:

Revit.Elements.TextNote.InternalSetType(System.String,Autodesk.Revit.DB.TextNoteType,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.HorizontalTextAlignment,System.Double)
Set Text
value:
type:
location:
alignment:
angle:

Revit.Elements.TextNote.InitElement(Autodesk.Revit.DB.TextNote)
Init element from existing
element:

Revit.Elements.TextNote.Init(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.HorizontalTextAlignment,System.String,System.Boolean,System.Double,Autodesk.Revit.DB.ElementId)
Init element by location
view:
origin:
alignment:
text:
keepRotatedTextreadable:
rotation: in degrees
typeId:

Revit.Elements.TextNote.ByLocation(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point,System.String,System.String,Revit.Elements.TextNoteType,System.Boolean,System.Double)
Construct a new Revit TextNote by Location
view: View to place text element on
location: Location in view
text: Text
alignment: Text alignment
keepRotatedTextReadable: Keep text horizontal
rotation: Rotation in degrees
type: Revit TextNote Type
Returns:

Revit.Elements.TextNote.Text
Get Text

Revit.Elements.TextNote.SetText(System.String)
Set Text
value:

Revit.Elements.TextNote.SetKeepRotatedTextReadable(System.Boolean)
Set Keep Rotated Text Readable
value:

Revit.Elements.TextNote.SetHorizontalAlignment(System.String)
Set Horizontal Text Alignment
value:

Revit.Elements.TextNote.HorizontalAlignment
Get Horizontal Alignment

Revit.Elements.TextNote.VerticalAlignment
Get Vertical Alignment

Revit.Elements.TextNote.Height
Get Height

Revit.Elements.TextNote.Typename
Get Typename

Revit.Elements.TextNote.FromExisting(Autodesk.Revit.DB.TextNote,System.Boolean)
Create from existing
instance:
isRevitOwned:
Returns: